Revit 2027 API
PerformanceAdviser.IsRuleEnabled(Int32) Method
 Retrieves an enabled/disabled status for the given rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsRuleEnabled(
	int index
)
Public Function IsRuleEnabled (
	index As Integer
) As Boolean
public:
bool IsRuleEnabled(
	int index
)
member IsRuleEnabled :
        index : int -> bool
Parameters
index Int32
 The rule index to retrieve enabled/disabled status for.
Return Value
Boolean
 True if rule is disabled, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  The index is outside of acceptable range.
See Also
Reference
PerformanceAdviser Class
IsRuleEnabled Overload
Autodesk.Revit.DB Namespace